non_play_colors = [None, "#000000"]

COLOR_MAP = {
    0: None,  # Отсутствие цвета
    1: "#FFFFFF",  # Белый
    2: "#FF0000",  # Ярко-красный
    3: "#008000",  # Зеленый
    4: "#00FF00",  # Ярко-зеленый
    5: "#0000FF",  # Синий
    6: "#ADD8E6",  # Светло-синий
    7: "#FFFF00",  # Желтый
    8: "#FFC0CB",  # Розовый
    9: "#FFA500",  # Оранжевый
    10: "#000000",  # Чёрный
}

COLOR_TEXT = {
    None: "Отсутствие цвета",
    "#FFFFFF": "Белый",
    "#FF0000": "Ярко-красный",
    "#008000": "Зеленый",
    "#00FF00": "Ярко-зеленый",
    "#0000FF": "Синий",
    "#ADD8E6": "Светло-синий",
    "#FFFF00": "Желтый",
    "#FFC0CB": "Розовый",
    "#FFA500": "Оранжевый",
    "#000000": "Чёрный",
}
